'''
给你一个由 '1'（陆地）和 '0'（水）组成的的二维网格，请你计算网格中岛屿的数量。

岛屿总是被水包围，并且每座岛屿只能由水平方向和/或竖直方向上相邻的陆地连接形成。

此外，你可以假设该网格的四条边均被水包围。

 

示例 1：

输入：grid = [
  ['1','1','1','1','0'],
  ['1','1','0','1','0'],
  ['1','1','0','0','0'],
  ['0','0','0','0','0']
]
输出：1
示例 2：

输入：grid = [
  ['1','1','0','0','0'],
  ['1','1','0','0','0'],
  ['0','0','1','0','0'],
  ['0','0','0','1','1']
]
输出：3
'''

class Solution:
    def numIslands(self, grid: List[List[str]]) -> int:
        # 特殊情况处理
        if not grid or not grid[0]:
            return 0
        row = len(grid) - 1 # 行数
        col = len(grid[0]) - 1 # 列数
        res = 0 # 岛屿数量

        # 本质上是一个四叉树深度优先搜索的过程，遇到陆地就记录这个地方已经被访问过，然后继续搜索它的上下左右四个方向
        def dfs(grid, i, j):
            # 终止条件
            if i < 0 or i > row or j < 0 or j > col:
                return
            # 如果当前格子不是陆地，直接返回
            if grid[i][j] != '1':
                return
            # 将当前格子标记为已访问过
            grid[i][j] = '2'

            # 继续搜索上下左右四个方向
            dfs(grid, i-1, j)
            dfs(grid, i+1, j)
            dfs(grid, i, j-1)
            dfs(grid, i, j+1) 

        # 遍历整个网格，遇到陆地就进行深度优先搜索，并将岛屿数量加一
        for i in range(0, row + 1):
            for j in range(0, col + 1):
                # 如果当前格子是陆地，就进行深度优先搜索，并将岛屿数量加一
                if grid[i][j] == '1':
                    dfs(grid, i, j)
                    res += 1
        # 返回岛屿数量
        return res
            
        